{"id":1320,"date":"2016-01-04T15:30:05","date_gmt":"2016-01-04T15:30:05","guid":{"rendered":"http:\/\/aerospaceengineeringblog.com\/?page_id=1320"},"modified":"2018-07-24T15:36:32","modified_gmt":"2018-07-24T15:36:32","slug":"books","status":"publish","type":"page","link":"https:\/\/aerospaceengineeringblog.com\/books\/","title":{"rendered":"Books"},"content":{"rendered":"<p>Below you will find a list of aerospace-related books that I have read over the years. Many of these books are absolute classics and I have revisited many of them on more than one occasion. In the list below you will find quite an eclectic mix of popular science writing and biographies (e.g. astronaut Hadfield and Elon Musk), but also more niche books about influential, yet widely unknown aerospace pioneers (e.g. von Kármán). This list is continuously updated, when I stumble across books that I think are worth your time and will expand your appreciation for aerospace engineering.<\/p>\n<p>Oh yeah, and if you decide to buy one of the recommended books, then I would appreciate if you click-through to Amazon using the links provided. That means you indirectly support this website by providing me with an affiliate fee (at no extra cost to you). Thank you very much, and I hope you enjoy these book recommendations!<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0609809989\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0609809989&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=b83fd1529b3b4fda954e8d2226f4ccca\" target=\"_blank\" rel=\"noopener\">Ubiquity: Why Catastrophes Happen<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0609809989\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is not directly an aerospace engineering book. But it is a fascinating book about the non-equilibrium physics of complex systems poised at the critical state. In this sense it provides a useful perspective of why catastrophes can happen in engineering systems, and why, despite our best efforts, they are sometimes unavoidable. The bottom line of the book is that, in a system poised at the critical state, big events and small events have the same fundamental cause. The difference in outcome depends only on where the trigger strikes. That is an a area of highly connected instability, where one event triggers others, or an area of less connected instability, where one event is arrested by areas not poised for instability, circuit breakers, friction etc. Understanding the origins of the critical state as interconnected regions poised on the threshold to instability, we may believe that we can simply map those regions and prevent any triggers from setting off avalanches, or perhaps tactically relieve stress in critical areas. But such an approach requires either accurate, comprehensive and detailed measurement, which is impossible in a large complex system, or models with accurate predictive powers. This is equally unfeasible when the system is chaotic, i.e. highly sensitive to initial conditions and history, as is likely in complex systems. So what we are left with is that in complex systems, including engineering systems where many different components interface, inconsequential failures will happen, and consequential failures will happen too. Thus, the best antidote to unwanted large-scale catastrophes is to ensure that small failures can&#8217;t propagate by installing &#8220;circuit-breakers&#8221;.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/156347705X\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=156347705X&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=ddb1ac471020489f8d4c8f0f3760750a\" target=\"_blank\" rel=\"noopener\">Blazing the Trail: The Early History of Spacecraft and Rocketry (Library of Flight)<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=156347705X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; With commercial rocket companies reaching new breakthroughs in rocket technology, I have recently been very intrigued in going back and studying the history of how we go to where we are today. This book retells the fascinating story of rocket science &#8211; from the history of early rocketry to the developments of the space age. The book is certainly a very detailed and in-depth account of explaining very narrow technical aspects but also providing a 360° degree view of the pioneering atmosphere of different times by retelling stories of individual engineers. In this sense Prof. Gruntman has certainly written an encyclopedic history of the evolution of rocketry. The book is structured as a succession of ideas of all the well-known players like Konstantin Tsiolkovsky, Hermann Oberth and Robert Goddard which provides a very useful foundation to understanding the developments during the Space Age. Even though I spent many hours researching for my own <a href=\"https:\/\/aerospaceengineeringblog.com\/history-of-rocket-science\/\" target=\"_blank\" rel=\"noopener\">History of Rocket Science<\/a> post, I learned a ton from this book. It&#8217;s certainly one of those reference books you can always go back to.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/1501123629\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=1501123629&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=90471e3e3734360aa59b5b4e7288d846\" target=\"_blank\" rel=\"noopener\">Into the Black: The Extraordinary Untold Story of the First Flight of the Space Shuttle Columbia and the Astronauts Who Flew Her<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=1501123629\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is a new book on the birth and service of the space shuttle Columbia. It&#8217;s not a very technical book but nonetheless a very exciting read. The book is based on interviews and declassified materials that tell the story of how the space shuttle was designed, and why it was important to do so. Books that attempt to weave together technical history and adventure are not so easy to pull off; they either get lost in technical details or sound too condescending. But &#8220;Into the Black&#8221; definitely gets it right! Even Chris Hadfield, the Canadian astronaut of &#8220;Space Oddity&#8221; fame loves the book: “Beautifully researched and written, Into The Black tells the true, complete story of the Space Shuttle better than it’s ever been told before.”<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0316907537\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0316907537&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=f9b2749c0aa3031a07b3d74371af1696\" target=\"_blank\" rel=\"noopener\">Wind and Beyond<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0316907537\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; I can&#8217;t recommend this book enough; it&#8217;s definitely one of the best engineering biographies I have ever read. Theodore von Kármán was a Hungarian-born aerodynamicist, professor and rocket pioneer who is known relatively little outside of academia, even though he received the National Medal of Science from President Kennedy, was instrumental in developing the modern US Air Force, founded the first private rocket company in the USA and was good friends with many of the prominent scientists of the time, like Albert Einstein, Edward Teller and John von Neumann. He studied under Ludwig Prandtl, one of the pioneers of aerodynamics, in Germany and then founded one of the prime aerodynamics departments at the University of Aachen, building one of the biggest wind tunnels at the time. What is fascinating about the book is that the reader gets to re-live the era starting from WWI until the first moon landing, a period when aerospace technology was advancing like mad. In this sense, shadowing von Kármán is so exciting as he was a polymath working on breakthroughs in turbulent aerodynamics, the buckling of rockets shells and wing panels, supersonic aerodynamics and combustion, and therefore right at the forefront of aerospace developments. More than anything though it is his fascinating story telling that makes this book such a nice combination of technical insight and entertainment.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0140135979\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0140135979&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=b63da4d28199ecd55f9c4c3eccc45ca8\" target=\"_blank\" rel=\"noopener\">The New Science of Strong Materials: Or Why You Don&#8217;t Fall Through the Floor (Penguin Science)<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0140135979\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This book was recommended reading by one of my professors when I started my PhD. It is a book explaining in a clear and no-nonsense style why materials exhibit their specific properties and why they behave the way they do. Why is wood weaker than steel? And why is glass incredibly strong when manufactured as thin whiskers but shatters easily as a bulk material? What is special about the author, Prof. J E Gordon, is that he is capable of conveying very technical matters in the style of a novel that is enticing to read and educating at the same time. The book is full of chemistry, physics and engineering but Gordon conveys the underlying physical insights using simple analogies that will stay with you for a long time.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/1119065992\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=1119065992&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=8d7d8d0d6675d974e9aaa55f3d7b47b7\" target=\"_blank\" rel=\"noopener\">The Jet Engine<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=1119065992\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is one of my all time favourite engineering books. I don&#8217;t know any other book that describes the design of modern jet engines in the same detail. Basically everything is covered: the basic theory, compressors, combustion chambers, turbines, nozzles, cooling systems, you name it, it&#8217;s in there. What&#8217;s more, even though there are a lot equations in this book, this is one of the rare occasions where the maths is used to provide physical insight into the governing factors that drive jet engine design. So even if equations are not your thing, you would still learn a ton from this book as the significance of the equations are always explained in plain English. Finally, in my opinion the art work and picture collection in this book make it worth the price of entry alone.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/1439148813\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=1439148813&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=2856d254f39f04643caa719d2db232c5\" target=\"_blank\" rel=\"noopener\">Failure Is Not an Option: Mission Control from Mercury to Apollo 13 and Beyond<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=1439148813\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em>&#8212; I have been meaning to read this book for a very long time, and after a friend lend me his copy there was little to stop me. It&#8217;s one of the classic books on the Space Race, America&#8217;s early struggles to keep up with the Russians and the subsequent successes of the Mercury, Gemini and Apollo lunar missions. The book is a memoir of NASA flight director Gene Kranz who was the mission controller for both the descent stage to the moon of Apollo 11 and the infamous Apollo 13 mission (&#8220;Houston, we&#8217;ve had a problem&#8221;). Kranz, a former jet pilot, started early in the space programme and was therefore able to witness firsthand the early days of the Mercury project to the last days of Apollo program, telling exciting story of successes, like John Glenn&#8217;s first Earth orbit, the first space walk and the lunar landing, and tragic failures, such as early difficulties with blowing up Redstone rockets and the Apollo 1 fire. In hindsight it seems a miracle that the U.S. could go from blowing up rockets in 1960 to landing on the moon in 1969, and this short nine-year span suggests that progress must have been smooth and ever upward. Of course, this was not so. Early failures during the Apollo program meant that the schedule to reach the moon had to be shortened considerably, combining multiple mission into larger single missions, which resulted in the U.S. launching big Saturn V rockets every two months from Apollo 7 &#8211; Apollo 11. A great takeaway of the book is Kranz&#8217; focus on multidisciplinary thinking, which allowed him to interpret new information during a launch incredibly quickly and make quick decisions in a high-pressure, high-uncertainty environment. In his words,<\/p>\n<blockquote><p>&#8220;Learning by doing equipped the controllers with a gut-level knowledge of spacecraft design and operations. When this knowledge was combined with the multidisciplinary skills of the mission team and the integrated risk assessments developed through the mission rules, the Flight Control team had the foundation needed to succeed in the new environment of space. Flight control rapidly became the dominant systems engineering cadre in the U.S. space program.&#8221;<\/p><\/blockquote>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0753822091\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0753822091&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=dc7fc13adda720535ed55e60662e440d\" target=\"_blank\" rel=\"noopener\">Wings on My Sleeve: The World&#8217;s Greatest Test Pilot tells his story<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0753822091\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is the autobiographical story of British WWII fighter pilot and post-WWII test pilot Eric Brown. He is the most-decorated pilot of the Royal Navy, having flown most of the RAF category planes, and achieved a number of accomplishments in naval aviation, including the first landing on an aircraft carrier with a twin-engined aircraft, a jet propelled aircraft and a rotary-wing aircraft. After the war he was an enthusiastic pioneer of jet aircraft and throughout the book he recounts some terrifying flights in very primitive jets. Due to his pre-war experiences as a student in Germany, he also became an expert in evaluating surrendered German planes. The book is, perhaps, a bit thin on technical details and the book reads more like an episodal anthology than a well-constructed novel. But the stories Eric Brown does tell are entertaining and remind us of a time when technological advances in aviation were part of a daring adventure.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0813595835\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0813595835&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=2564f8fe25b96941a80ea101a55b8a82\" target=\"_blank\" rel=\"noopener\">Ignition!: An Informal History of Liquid Rocket Propellants<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0813595835\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; The author, John D. Clark, is one of the early pioneers of American rocketry, and as chief chemist at the Naval Rocket Air Test Station, was involved in developing a number of liquid rocket fuels and tinkering with exotic chemicals to characterise which combinations are, basically, just right for a controlled explosion and which combinations are too explosive. The book describes the research behind developing new liquid rocket fuels, and provides a good amount of detail on the chemistry involved. Clark was also a science fiction writer and is a natural at weaving the technicalities into funny anecdotes about other scientists and their antics, as well as other explosive events. The book comes highly recommended by no other than Isaac Asimov who wrote the foreword to the book.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0199578699\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0199578699&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=5e4c5274bf99fa2561cb3f18a51b7a7e\" target=\"_blank\" rel=\"noopener\">Engineering: A Very Short Introduction (Very Short Introductions)<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0199578699\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; David Blockley is a professor emeritus at my alma mater, the University of Bristol. In this short and very readable book, he provides a brief introduction to what engineering is all about: turning an idea into reality. The book covers multiple centuries of the engineering profession, from the early Greeks, to the industrial revolution, and then to the modern information driven age. What I particularly cherished about the book is how Prof. Blockley manages to boil down the essentials of the different disciplines of engineering, and thereby provides an overview of the key factors that govern each discipline and how they relate to each other. He ends the book with a chapter on the importance of systems thinking in the 21st century, i.e. the necessity for the modern engineer to understand the basics of different engineering disciplines, and appreciate how disparate components of complex systems interact.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/075355562X\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=075355562X&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=7e1f209958d33508535a17d2731281c7\" target=\"_blank\" rel=\"noopener\">Elon Musk: How the Billionaire CEO of SpaceX and Tesla is Shaping our Future<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=075355562X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; Elon needs no introduction. He was the co-founder of PayPal, which made him a multi-millionaire, and is the CEO of Tesla Motors and Space X. He is best known for his ambitious goals of retiring on Mars, manufacturing the first mass-market electric car, making solar panels affordable and designing the innovative Hyperloop transportation system. He is a physicist by training and what I find most instructive about him is what he calls thinking from fundamentals rather than by analogy. Hence, understanding the fundamental physics behind a problem, isolating the key drivers of a problem and then engineering a solutions from this basic understanding, rather than trying to bootstrap a solution to an existing system. Such an analysis led to the conclusion that a re-usable rocket would reduce the cost of spaceflight by orders of magnitude, and therefore SpaceX is working hard to design such a rocket. The final verdict on his endeavour is still out, but Elon is certainly to be marvelled at for his incessant ability to think big and tackle new frontiers.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/1476728747\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=1476728747&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=d196f4e2a91778cba40fdd89e469859f\" target=\"_blank\" rel=\"noopener\">The Wright Brothers<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=1476728747\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is really a superb book about the two arguably greatest aerospace engineers in the history of flight. Even after spending a couple of hours at Kitty Hawk this spring, and reading up on the Wright Brothers, this book was full of interesting nuggets about the Wright Brothers. As the quote above suggests, the Wrights weren&#8217;t only brilliant engineers and scientists but also witty, deeply interested in art and literature, and just two down-to-earth blokes from Ohio. As bicycle mechanics they had an intuitive understanding of mechanisms and engineering construction, but their inquisitive minds led them to study the entire scientific theoretical background to aviation. They were the first to realise that a flying machine would require mastery of three aspects: propulsion, aerodynamic lift and contro. Indeed they were masters of all three areas, which could not be said of many other aviators of the time. Not only did they build the frame of the Wright Flyer, but also designed and built all the propellers, the single-cylinder engine, the wing-warping control system and their own wind-tunnel to test different aerofoil shapes. The latter was necessary as they figured out that the tabulated lift coefficients by many of the previous aviators like Otto Lilienthal and Octave Chanute were simply wrong. And all of this on their own dime, purely from the proceeds of their bicycle shop, while others, like Samuel Pierpont Langley, had the financial backing of the US government. The Wright brothers significance in aviation can not be overstated, and at the same time, their achievement is a superb example of how dedication and sound engineering principles can lead to success.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0393326020\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0393326020&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=78c2a8fb2ce23c8d9dd41922e99fadbb\" target=\"_blank\" rel=\"noopener\">Howard Hughes: His Life and Madness<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0393326020\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; I read Howard Hughes biography in August and it was a truly riveting story. Howard Hughes inherited the Hughes Tool Company from his father and after buying out other family members took control of the multi-million dollar company in his early twenties. An aviation enthusiast he spent a lot of his fortune and company earnings in the 1930-40s on designing faster aircraft, setting up the Hughes Aircraft Company, accomplishing new long distance flying records or making movies in Hollywood. His aircraft company designed some iconic aircraft, like the &#8220;Spruce Goose&#8221; flying boat, but in the end was not successful in becoming a major contractor to the US Air Force, mainly because Hughes could not deliver on this promises. The Hughes Aircraft Company was however successful in designing modern missile systems and satellites that are used to this day, and the company is now part of Raytheon. A biography about Hughes would not be complete without investigating some of the mania behind the man. Hughes was a codeine addict, a recluse who was afraid of both germs and the public, frittered away a massive fortune and seemed to have lived in a parallel universe most of his lifetime. Granted his maniacal tendencies probably facilitated his daring endeavours in aviation and business, but the book is still a cautionary tale of a man&#8217;s downfall.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0316253030\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0316253030&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=6c6205b1ef2e1e13e1d008fb485cddec\" target=\"_blank\" rel=\"noopener\">An Astronaut&#8217;s Guide to Life on Earth: What Going to Space Taught Me about Ingenuity, Determination, and Being Prepared for Anything<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0316253030\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; Chris Hadfield was the commander of ISS as part of Expedition 35 &#8211; the 35th long duration mission to ISS. He is more widely known for his rendition of David Bowie&#8217;s <a href=\"https:\/\/www.youtube.com\/watch?v=KaOC9danxNo\" target=\"_blank\" rel=\"noopener\">Space Oddity<\/a> and his interesting videos about <a href=\"https:\/\/www.youtube.com\/results?search_query=chris+hadfield\" target=\"_blank\" rel=\"noopener\">day-to-day life on the ISS<\/a>. I listened to the Audiobook version of his recent autobiography, and his lessons drawn from preparing and training to be an astronaut on Earth, and the challenges and exhilaration of commanding our only extra-terrestrial home. Chris provides some interesting life lessons, but also goes into the details of astronaut training, the minutiae of rocket launches, technical details and funny escapades with other Russian cosmonauts. All in all a very entertaining read\/listen.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/1563476967\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=1563476967&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=0f1411ba6758e253dcb350fdd63077fb\" target=\"_blank\" rel=\"noopener\">The Rocket Company (Library of Flight)<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=1563476967\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; This is a book I really enjoyed telling the story of setting up a hypothetical rocket company and trying to solve some of the issues regarding sustainability and reusability of rockets that SpaceX is currently trying to tackle. It is no wonder that Elon Musk has called this book an &#8220;interesting approach to the greatest problem in space exploration: the cost of getting there.&#8221; This book will educate you about various facets of rocketry; not only the technical side such as tradeoffs between solid and liquid fuelled boosters, different multistage designs and heat shields, but also the business side of things that are often neglected in other books on the topic.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/B002XHNNHU\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=B002XHNNHU&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=19fba009a531ff27c063f7915aef0302\" target=\"_blank\" rel=\"noopener\">Structures: Or Why Things Don&#8217;t Fall Down<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=B002XHNNHU\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em> &#8212; Elon Musk has <a href=\"http:\/\/www.farnamstreetblog.com\/2014\/11\/elon-musk-book-recommendations\/\" target=\"_blank\" rel=\"noopener\">recommended this book<\/a>, and as a structural engineer I absolutely love it. The book is a rare example of technical writing that is incredibly enjoyable to read, without pretending to be too &#8220;nerdy&#8221; on one hand or &#8220;condescending&#8221; on the other. Gordon, the author, started as a naval engineer in Glasgow and then moved on to work at the Royal Aircraft Establishment at Farnborough, which was responsible for many iconic aircraft during the Cold War. As a result, he gained lots of experience with working with a number of materials ranging from metals and natural wooden materials, to plastics and ceramics. Throughout the book Gordon discusses a wide range of structures you see in everyday life including skeletons, bridges, boats and cathedrals, and this really raises your appreciation for the the subject. I remember sitting in <a href=\"https:\/\/en.wikipedia.org\/wiki\/Sacr%C3%A9-C%C5%93ur%2C_Paris\" target=\"_blank\" rel=\"noopener\">Sacre-Coeur Basilica<\/a> in Paris and gazing up at all the intricate arches that hold up the domed ceiling, and marvelling at the genius of this type of construction that Gordon discusses in this book.<\/p>\n<hr \/>\n<p><em><strong><a href=\"https:\/\/www.amazon.co.uk\/gp\/product\/0751515035\/ref=as_li_tl?ie=UTF8&amp;camp=1634&amp;creative=6738&amp;creativeASIN=0751515035&amp;linkCode=as2&amp;tag=aerosenginblo-21&amp;linkId=7d401770238dd5b26fb9f77a121ef6a8\" target=\"_blank\" rel=\"noopener\">Skunk Works: A Personal Memoir of My Years at Lockheed<\/a><img decoding=\"async\" loading=\"lazy\" style=\"border: none !important; margin: 0px !important;\" src=\"\/\/ir-uk.amazon-adsystem.com\/e\/ir?t=aerosenginblo-21&amp;l=am2&amp;o=2&amp;a=0751515035\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" \/><\/strong><\/em>&#8212; This is a great book about one of the most successful aerospace design teams of the 21st century &#8211; Lockheed&#8217;s secret Skunk Works. The book is a personal memoir of Ben Rich who was the operations boss for two decades and retells the story of iconic aircraft such as the U2, the SR-71 Blackbird and the F-117 Stealth Bomber. The book doesn&#8217;t only include great engineering wisdom but also case studies on how to foster innovation in large organisations and effectively manage design teams when they are being scrutinised external powers (e.g. such as politicians and military personnel) in times of crisis, i.e. the Cold War. I was most impressed at how the Skunk Works managed to design ground-breaking technology on time and on budget. A feat that nearly no large aerospace company is capable of today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Below you will find a list of aerospace-related books that I have read over the years. Many of these books are absolute classics and I have revisited many of them on more than one occasion. In the list below you will find quite an eclectic mix of popular science writing and biographies (e.g. astronaut Hadfield [&#8230;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/P2FJbz-li","jetpack-related-posts":[{"id":1728,"url":"https:\/\/aerospaceengineeringblog.com\/about\/start-here\/","url_meta":{"origin":1320,"position":0},"title":"Start Here","date":"January 31, 2017","format":false,"excerpt":"Getting Started About -- A few notes about what this site is all about. Good reads -- Books about aerospace & engineering that I have read, and that I highly recommend to visitors of this blog. Newsletter -- Each month I send out a digest of the newest posts on…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":587,"url":"https:\/\/aerospaceengineeringblog.com\/contact\/","url_meta":{"origin":1320,"position":1},"title":"Contact","date":"March 12, 2013","format":false,"excerpt":"I am a Royal Academy of Engineering Research Fellow and Lecturer in Digital Engineering of Structures based at the Bristol Composites Institute of the University of Bristol. My research focus is on lightweight design of engineering structures using composite materials (e.g. carbon-fibre reinforced plastics) and through multi-functional design (i.e. structures…","rel":"","context":"With 46 comments","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":1952,"url":"https:\/\/aerospaceengineeringblog.com\/aerospace-engineering-podcast\/","url_meta":{"origin":1320,"position":2},"title":"Podcast","date":"September 24, 2017","format":false,"excerpt":"This is an exciting time to be an aerospace engineer! Scientific breakthroughs in battery technology, machine learning, 3-D printing, and materials science are changing the way we design aircraft and rockets. These technologies have ushered in a new era in aerospace engineering, which will see transformations in the way we…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":983,"url":"https:\/\/aerospaceengineeringblog.com\/newsletter\/","url_meta":{"origin":1320,"position":3},"title":"Newsletter","date":"May 27, 2015","format":false,"excerpt":"Subscribe to the monthly newsletter of the Aerospace Engineering Blog   Each month I send out a digest of the newest posts and podcast episodes on this blog, as well as interesting book recommendations and other aerospace related articles, pictures and videos that I find across the internet.   If you…","rel":"","context":"With 1 comment","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2011,"url":"https:\/\/aerospaceengineeringblog.com\/support\/","url_meta":{"origin":1320,"position":4},"title":"Support","date":"October 31, 2017","format":false,"excerpt":"Support the Aerospace Engineering Blog This website is a free educational resource and will always remain so. It is as much about me trying to pass on some of the things I have learned about aerospace engineering, as it is about me learning from interactions with readers (for a good…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":6,"url":"https:\/\/aerospaceengineeringblog.com\/about\/","url_meta":{"origin":1320,"position":5},"title":"About this Blog","date":"March 6, 2012","format":false,"excerpt":"Insights into Aerospace Engineering and Aviation On December 17, 1903 the bicycle mechanic Orville Wright successfully piloted the first heavier-than-air machine, his brother Wilbur running alongside him to prevent the wing tip from touching the floor. The Wright Flyer was constructed mainly from wood and canvas with a 12 horse-power petrol…","rel":"","context":"With 6 comments","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/1320"}],"collection":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/comments?post=1320"}],"version-history":[{"count":18,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/1320\/revisions"}],"predecessor-version":[{"id":2009,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/1320\/revisions\/2009"}],"wp:attachment":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/media?parent=1320"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}