{"id":2251,"date":"2018-05-31T14:08:50","date_gmt":"2018-05-31T14:08:50","guid":{"rendered":"http:\/\/aerospaceengineeringblog.com\/?page_id=2251"},"modified":"2018-05-31T14:08:50","modified_gmt":"2018-05-31T14:08:50","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/aerospaceengineeringblog.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<h2>What personal data Aerospace Engineering Blog (we) collect and why we collect it<\/h2>\n<h3>Newsletter<\/h3>\n<p>You may subscribe to receive our monthly newsletter. Your email and name are never shared with anyone else, and your details are only kept until you unsubscribe. We use third-party vendor Mailchimp to distribute the newsletter. When you sign up for the newsletter you provide explicit consent for us to collect the above listed personal information.<\/p>\n<h3>Comments<\/h3>\n<p>When visitors leave comments on the site we collect the data shown in the comments form, and also the visitor’s IP address and browser user agent string to help spam detection.<\/p>\n<p>An anonymised string created from your email address (also called a hash) may be provided to the Gravatar service to see if you are using it. The Gravatar service privacy policy is available here: https:\/\/automattic.com\/privacy\/. After approval of your comment, your profile picture is visible to the public in the context of your comment.<\/p>\n<p>If you leave a comment on our site you may opt-in to saving your name, email address and website in cookies. These are for your convenience so that you do not have to fill in your details again when you leave another comment. These cookies will last for one year.<\/p>\n<h3>Embedded content from other websites<\/h3>\n<p>Articles on this site may include embedded content (e.g. videos, images, articles, etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.<\/p>\n<p>These websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracing your interaction with the embedded content if you have an account and are logged in to that website.<\/p>\n<p>We do not endorse and are not responsible for the information practices or privacy policies of any other Web sites that may be linked to or from the Site. If you decide to access any other Web site that may be linked to or from the Site, you should consult that Web site’s privacy policy.<\/p>\n<h2>What rights you have over your data<\/h2>\n<p>If you have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.<\/p>\n<h2>Disclosure of information<\/h2>\n<p>We will not voluntarily share your name and email provided via the Site to any third party, except:<\/p>\n<ul>\n<li>To comply with legal requirements, such as law, regulation, warrant, subpoena, court order, or with a regulator or law enforcement agency or personnel or<\/li>\n<li>In connection with a corporate sale, merger, reorganisation, acquisition, dissolution or similar event.<\/li>\n<\/ul>\n<h2>Securing Your Data<\/h2>\n<p>We will take reasonable technical and organisational precautions to prevent the loss, misuse or alteration of your personal information. If we store any of your data, we will do so on secure servers.<\/p>\n<p>We take reasonable steps to protect personal information from loss and misuse. Please keep in mind that no Internet transmission is 100% secure. Some email sent to or from the Site may not be secure. Please consider this when sending information to us by email.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What personal data Aerospace Engineering Blog (we) collect and why we collect it Newsletter <\/p>\n<p>You may subscribe to receive our monthly newsletter. Your email and name are never shared with anyone else, and your details are only kept until you unsubscribe. We use third-party vendor Mailchimp to distribute the newsletter. When you sign up for the [&#8230;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"jetpack_likes_enabled":true,"jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/P2FJbz-Aj","jetpack-related-posts":[{"id":983,"url":"https:\/\/aerospaceengineeringblog.com\/newsletter\/","url_meta":{"origin":2251,"position":0},"title":"Newsletter","date":"May 27, 2015","format":false,"excerpt":"Subscribe to the monthly newsletter of the Aerospace Engineering Blog   Each month I send out a digest of the newest posts and podcast episodes on this blog, as well as interesting book recommendations and other aerospace related articles, pictures and videos that I find across the internet.   If you…","rel":"","context":"With 1 comment","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":2011,"url":"https:\/\/aerospaceengineeringblog.com\/support\/","url_meta":{"origin":2251,"position":1},"title":"Support","date":"October 31, 2017","format":false,"excerpt":"Support the Aerospace Engineering Blog This website is a free educational resource and will always remain so. It is as much about me trying to pass on some of the things I have learned about aerospace engineering, as it is about me learning from interactions with readers (for a good…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":1728,"url":"https:\/\/aerospaceengineeringblog.com\/about\/start-here\/","url_meta":{"origin":2251,"position":2},"title":"Start Here","date":"January 31, 2017","format":false,"excerpt":"Getting Started About -- A few notes about what this site is all about. Good reads -- Books about aerospace & engineering that I have read, and that I highly recommend to visitors of this blog. Newsletter -- Each month I send out a digest of the newest posts on…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":1320,"url":"https:\/\/aerospaceengineeringblog.com\/books\/","url_meta":{"origin":2251,"position":3},"title":"Books","date":"January 4, 2016","format":false,"excerpt":"Below you will find a list of aerospace-related books that I have read over the years. Many of these books are absolute classics and I have revisited many of them on more than one occasion. In the list below you will find quite an eclectic mix of popular science writing…","rel":"","context":"Similar post","img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"_links":{"self":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/2251"}],"collection":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/comments?post=2251"}],"version-history":[{"count":3,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/2251\/revisions"}],"predecessor-version":[{"id":2254,"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/pages\/2251\/revisions\/2254"}],"wp:attachment":[{"href":"https:\/\/aerospaceengineeringblog.com\/wp-json\/wp\/v2\/media?parent=2251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}